var
  s: string; // объявляем переменную для хранения строки
  i: integer; // объявляем переменную для использования в цикле
  xIndex, wIndex: integer; // объявляем переменные для хранения индексов символов 'x' и 'w'
begin
  s := 'dgyhbdyhbxw'; // инициализируем строку
  xIndex := -1; // устанавливаем начальное значение индекса символа 'x'
  wIndex := -1; // устанавливаем начальное значение индекса символа 'w'
  
  for i := 1 to Length(s) do // проходим по строке
  begin
    if s[i] = 'x' then // если найден символ 'x'
    begin
      xIndex := i; // сохраняем индекс символа 'x'
      break; // выходим из цикла, так как нас интересует только первое вхождение
    end;
  end;
  
  for i := 1 to Length(s) do // проходим по строке еще раз
  begin
    if s[i] = 'w' then // если найден символ 'w'
    begin
      wIndex := i; // сохраняем индекс символа 'w'
      break; // выходим из цикла, так как нас интересует только первое вхождение
    end;
  end;
  
  if (xIndex = -1) and (wIndex = -1) then // если оба символа не найдены
    WriteLn('В строке нет символов x и w')
  else if xIndex = -1 then // если символ 'x' не найден
    WriteLn('x не найден')
  else if wIndex = -1 then // если символ 'w' не найден
    WriteLn('w не найдена')
  else if xIndex < wIndex then // если символ 'x' встречается раньше символа 'w'
    WriteLn('Символ x встречается раньше символа w')
  else // если символ 'w' встречается раньше символа 'x'
    WriteLn('Символ w встречается раньше символа x');
end. 
